Repository: 84000/data-translation-memory
Catalog: toh112-v3.tmx
Source language: bo
Languages: en

source: དེ་ཐོས་ནས་བྲམ་ཟེ་ལྷ་རྣམས་ཀྱིས་བསྒོ་བ་བཞིན་དུ་བྱའོ་ཞེས་སྨྲས་ཏེ།
en: Hearing this, the brahmin said, ‘I will do as the devas command.’

source: དེ་ནས་བྲམ་ཟེ་དེ་པད་མ་རྣམས་འགོད་བཞིན་པ་ལས་སད་པ་དང་།
en: As the brahmin was distributing the lotuses, he woke up.

source: དེ་མལ་ནས་ལངས་ཏེ་རྨི་ལམ་དྲན་ཞིང་འདུག་པ་ན་དེ་འདི་སྙམ་དུ་སེམས་ཏེ། འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་དེ་དང་།
en: Remembering the dream, he rose from his bed and thought, ‘The cakravartin and the princes made inferior prayers.

source: རྒྱལ་བུ་ཁ་ཅིག་ནི་སྨོན་ལམ་དམན་ཞིང་འཁོར་བའི་བདེ་བ་ལ་མངོན་པར་དགའ་བ་སྟེ།
en: They are attracted to the pleasures of saṃsāra.

source: དེ་དག་ནི་དམན་པ་ལ་མོས་པ་ཡིན་ནོ།
en: They have inferior aspirations.

source: །གང་དག་བདག་གིས་རྨི་ལམ་ན་སྣ་མའི་མེ་ཏོག་གིས་བརྒྱན་ཅིང་མ་ཧེའི་ཤིང་རྟ་དག་ལ་ཞོན་ཏེ། ལམ་གོལ་བར་ཞུགས་ནས་གཡས་ཕྱོགས་སུ་བལྟས་ཤིང་དོང་བར་མཐོང་བའི་རྒྱལ་བུ་ཁ་ཅིག་ནི་ཉན་ཐོས་ཀྱི་ཐེག་པ་འདོད་པ་ཡིན་ནོ།
en: Those princes I saw in my dream who were adorned with jasmine flowers, riding in buffalo carts, and going down a bad road facing south are those who aspire to the Śrāvakayāna.

source: །བདག་གིས་སྣང་བ་ཆེན་པོ་མཐོང་ཞིང་སྣང་བ་དེས་ཕྱོགས་བཅུའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་མཐོང་བ་གང་ཡིན་པ་དེ་ནི་བདག་གིས་འཛམ་བུའི་གླིང་ཐམས་ཅད་ན་གནས་པའི་སྲོག་ཆགས་བྱེ་བ་ཁྲག་ཁྲིག་འབུམ་ཕྲག་དུ་མ་དག་བསོད་ནམས་བྱ་བའི་དངོས་པོ་གསུམ་པོ་དག་ཡང་དག་པར་འཛིན་དུ་བཅུག་ཅིང་བཙུད་དེ་རབ་ཏུ་བཀོད་པ་དེའི་མཚན་མ་ཡིན་ཏེ།
en: I had a great vision. I saw the bhagavat buddhas in the ten directions. That is a sign of my having caused all the hundred thousand million trillion beings who live in Jambudvīpa to acquire, enter into, and remain in the three activities that create merit. The bhagavat buddhas in the other buddha realms in the ten directions bestowed lotuses upon me.

source: གང་གི་ཕྱིར་བདག་གི་འཛམ་བུའི་གླིང་མྱུལ་ཅིང་སེམས་ཅན་བགྲང་བ་ལས་ཡང་དག་པར་འདས་པ་དག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡང་དག་པར་འཛིན་དུ་བཅུག་ནས་བཏུལ་ཅིང་བཙུད་དེ་རབ་ཏུ་བཀོད་པ་གང་ཡིན་པ་དང་།
en: That is a sign that I have wandered throughout Jambudvīpa and caused countless beings to acquire, train in, and enter the aspiration for the highest, most complete enlightenment.

source: བདག་གིས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དགེ་སློང་གི་དགེ་འདུན་དང་བཅས་པ་ཡོ་བྱད་ཐམས་ཅད་ཀྱིས་ལོ་བདུན་དུ་སྤྱན་དྲངས་པ་དེས་ན། བདག་གིས་སྣང་བ་ཆེན་པོ་མཐོང་ཞིང་ཕྱོགས་བཅུའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱང་མཐོང་ལ།
en: And it is a sign that for seven years I provided the tathāgata arhat samyaksam­buddha and his saṅgha of bhikṣus with all necessities.

source: ཕྱོགས་བཅུའི་སངས་རྒྱས་ཀྱི་ཞིང་གཞན་དག་ནས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱིས་པད་མ་དག་བསྐུར་ཞིང་།
en: The bhagavat buddhas bestowed parasols upon me.

source: བདག་གིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སྨོན་ལམ་བཏབ་པ་གང་ཡིན་པ་དེས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་གིས་བདག་ལ་གདུགས་དག་བསྐུར་བ་ཡིན་ན།
en: That is a sign that I made a prayer for the highest, most complete enlightenment.

source: བདག་གིས་པད་མ་དེ་དག་ལ་ཉི་མའི་གཟུགས་དག་མཐོང་བ་གང་ཡིན་པ་དང་།
en: I also dreamt that I saw suns upon the lotuses; I saw their light rays enter my mouth.

source: བདག་གིས་འོད་ཟེར་དེ་དག་རང་གི་ཁར་ཞུགས་པར་མཐོང་བ་གང་ཡིན་པ་དང་། ལུས་ཆེན་པོར་གྱུར་པར་མཐོང་བ་གང་ཡིན་པ་དང་། ཉི་མའི་གཟུགས་རྣམས་ཕྲེང་བ་དངར་བར་མཐོང་བ་གང་ཡིན་པ་དང་། ཁོང་པ་ན་བྱང་ཆུབ་སེམས་དཔའ་བྱེ་བ་ཁྲག་ཁྲིག་འབུམ་ཕྲག་དྲུག་ཅུ་པད་མ་དག་ལ་སྐྱིལ་མོ་ཀྲུང་བཅས་ཏེ་འདུག་ཅིང་བསམ་གཏན་བྱེད་པ་གང་ཡིན་པ་དེ་ལྟ་བུའི་རྨི་ལམ་དག་རྨི་བ་དང་།
en: I saw my body become vast; I saw a garland of suns; I saw hundreds of thousands of millions of trillions of bodhisattvas sitting cross-legged and meditating inside me.

source: བདག་གིས་བརྒྱ་བྱིན་དང་། ཚངས་པ་དང་། འཇིག་རྟེན་སྐྱོང་བ་དག་མཐོང་ཞིང་པད་མ་འདི་དག་བགོས་ཤིག་ཅེས་བསྒོ་བ་གང་ཡིན་པ་དང་།
en: I saw Śakra, Brahmā, and the guardians of the world, who instructed me to distribute the lotuses, and I dreamt that I distributed the lotuses.

source: བདག་གིས་པད་མ་དེ་དག་བགོས་ཏེ་བྱིན་པ་གང་ཡིན་པའི་རྨི་ལམ་དེ་དག་བདག་གིས་བཅོམ་ལྡན་འདས་ལ་གསོལ་ཞིང་རྒྱུ་གང་དང་རྐྱེན་གང་གིས་ན་བདག་ལ་དེ་ལྟ་བུའི་རྨི་ལམ་དག་རྨིས་ཞེས་བདག་གིས་དེ་བཞིན་གཤེགས་པ་ལ་ཞུའོ་སྙམ་མོ།
en: I will describe this dream to the Bhagavat Buddha and ask the Tathāgata what the causes and circumstances for my dream were.’ “

source: །དེ་ནས་བྲམ་ཟེ་རྒྱ་མཚོའི་རྡུལ་གྱིས་དེ་ཉིད་ཀྱི་མཚན་མོ་འདས་པ་དང་ཞལ་ཟས་སྦྱར་ནས་ནང་པར་སྔར་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་པ་དང་།
en: Then, when that night was over, the brahmin Samudrareṇu prepared food and went early to where the Bhagavat was.

source: བདག་ཉིད་ཀྱིས་བཅོམ་ལྡན་འདས་དང་། དགེ་སློང་གི་དགེ་འདུན་ཕྱག་ཆབ་གསོལ་ཏོ།
en: He personally washed the hands of the Bhagavat and his saṅgha of bhikṣus.

source: །ཕྱག་ཆབ་གསོལ་ནས་ཀྱང་བདག་ཉིད་ལག་དར་ཏེ་བཟའ་བ་དང་བཅའ་བ་མང་པོ་དག་ལེགས་པར་བསྟབས་ཤིང་ཚིམ་པར་བྱས་སོ།
en: After he had washed their hands, with his own hands he served and satisfied the Bhagavat with much food and drink.

source: །ལེགས་པར་བསྟབས་ཤིང་ཚིམ་པར་བྱས་ནས་ཀྱང་དགེ་སློང་གི་དགེ་འདུན་ལ་ཡང་རྣམ་གྲངས་དུ་མས་ལེགས་པར་བསྟབས་ཤིང་ཚིམ་པར་བྱས་སོ།
en: After he had served and satisfied him, he served and satisfied the saṅgha of bhikṣus many times.

source: །རྣམ་གྲངས་དུ་མས་ལེགས་པར་བསྟབས་ཤིང་ཚིམ་པར་བྱས། བཅོམ་ལྡན་འདས་དང་དགེ་སློང་གི་དགེ་འདུན་བཤོས་གསོལ་ལགས་ཏེ། ལྷུང་བཟེད་བཞག་ཅིང་ཕྱག་བཅབས་པར་རིག་ནས། སྟན་ཤིན་ཏུ་དམའ་བ་ཞིག་བླངས་ནས་ཆོས་མཉན་པའི་ཕྱིར་བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་འདུག་གོ།
en: After he had repeatedly served and satisfied them, seeing that the Bhagavat and his saṅgha of bhikṣus had eaten, washed their hands, and put down their alms bowls, he sat on a low seat before the Bhagavat in order to hear the Dharma. “

source: །དེ་ནས་རྒྱལ་པོ་རྩིབས་ཀྱི་མུ་ཁྱུད་ཀྱང་བུ་སྟོང་དང་ལྷན་ཅིག་ཏུ་སྲོག་ཆགས་སྟོང་ཕྲག་དུ་མས་ཡོངས་སུ་བསྐོར་ཅིང་མདུན་དུ་བདར་ཏེ།
en: Then King Araṇemin, accompanied by his thousand sons and many thousands of beings, came into the presence of the Bhagavat.

source: དེ་ཉིད་དུ་འོངས་ནས་དེ་བཞོན་པས་བགྲོད་པའི་ས་ཇི་སྲིད་པ་དེ་སྲིད་དུ་བཞོན་པས་སོང་སྟེ། བཞོན་པ་ལས་བབས་ནས་རྐང་པས་ཀུན་དགའི་ར་བར་ཞུགས་སོ།
en: He traveled by carriage as far as there was ground for a carriage to travel on, continued on foot, and entered the parkland.

source: །ཞུགས་ནས་ཀྱང་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་པ་དང་། བཅོམ་ལྡན་འདས་དང་། དགེ་སློང་གི་དགེ་འདུན་གྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ། ཆོས་མཉན་པའི་ཕྱིར་བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་འདུག་གོ།
en: After entering the park, he approached the Bhagavat, bowed his head to the feet of the Bhagavat and his saṅgha of bhikṣus, and then sat before the Bhagavat to hear the Dharma. “

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ལ་བྲམ་ཟེ་རྒྱ་མཚོའི་རྡུལ་གྱིས་རྨི་ལམ་ཇི་རྨིས་པ་དག་གསོལ་པ་དང་།
en: Then the brahmin Samudrareṇu described his dreams to the Bhagavat.

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། བྲམ་ཟེ་གང་ཁྱོད་ཀྱིས་སྣང་བ་ཆེན་པོ་དང་། སྣང་བ་དེས་སངས་རྒྱས་ཀྱི་ཞིང་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དག་གི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་མཐོང་ནས་ཁྱོད་ལ་པད་མ་དག་བསྐུར་བ་དང་།
en: The Bhagavat said, ‘You had a great vision in which you saw bhagavat buddhas in buddha realms as numerous as the grains of sand in the Ganges River, who gave you lotuses.

source: པད་མ་དེ་དག་ལ་ཉི་མའི་གཟུགས་འོད་ཟེར་རབ་ཏུ་འབྱུང་བ་དག་མཐོང་བ་དང་།
en: You saw brightly shining suns on those lotuses and saw their light rays entering your mouth.

source: འོད་ཟེར་དེ་དག་ཁྱོད་ཀྱི་ཁར་ཞུགས་པར་མཐོང་བ་ནི་བྲམ་ཟེ་གང་ཁྱོད་ལོ་ཉིས་བརྒྱ་ལྔ་བཅུར་འཛམ་བུའི་གླིང་ཉུལ་བར་བྱེད་པ་ནི་ཁྱོད་ཀྱིས་མྱུལ་བ་དེས་སེམས་ཅན་བགྲང་བ་ལས་ཡང་དག་པར་འདས་པ་དག་བསོད་ནམས་བྱ་བའི་དངོས་པོ་གསུམ་པོ་དག་ལ་བཙུད་ཅིང་རབ་ཏུ་བཀོད་པ་དང་།
en: Brahmin, for two hundred and fifty years you wandered through Jambudvīpa.

source: སེམས་ཅན་བགྲང་བ་ལས་ཡང་དག་པར་འདས་པ་དག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཡང་དག་པར་འཛིན་དུ་བཅུག་སྟེ་བཏུལ་ཅིང་བཙུད་དེ་རབ་ཏུ་བཀོད་པ་དང་།
en: During that wandering you caused innumerable beings to acquire and remain in the three activities that create merit, and you caused them to acquire, enter into, and remain in the aspiration for the highest, most complete enlightenment and to commence upon this Mahāyāna.

source: ཐེག་པ་ཆེན་པོ་འདི་ལ་བརྩམ་པ་བྱས་པ་དེས་ན་གང་དག་གིས་ཁྱོད་ལ་པད་མ་གང་དག་ལ་ཉི་མའི་གཟུགས་དག་སྣང་བའི་པད་མ་འདབ་མ་རྣམས་ནི་གསེར། སྡོང་བུ་རྣམས་ནི་དངུལ། སྙིང་པོ་རྣམས་ནི་བཻ་དཱུརྱ། ཟེ་བ་རྣམས་ནི་རྡོའི་སྙིང་པོ་ལས་བྱས་པ་དག་བསྐུར་བའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དག་ན་བཞུགས་ཏེ་འཚོ་ཞིང་གཞེས་ལ་ཆོས་ཀྱང་སྟོན་པ།
en: That is why the bhagavat buddhas who reside, live, and remain, teaching the Dharma in realms in the ten directions as numerous as the grains of sand in the Ganges River, gave you lotuses with gold petals, silver stems, beryl pericarps, and emerald anthers, with suns upon those lotuses.

source: དེ་དག་གིས་བྲམ་ཟེ་ཁྱོད་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ལུང་བསྟན་པར་གྱུར་ཏེ།
en: They were prophesying to you, brahmin, your highest, most complete enlightenment.

source: རྨི་ལམ་དེ་ནི་དེའི་སྔ་ལྟས་ཡིན་ནོ།
en: That dream was its omen.

source: །བྲམ་ཟེ་གང་ཁྱོད་ཀྱི་རྨི་ལམ་ན་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དག་ན་སངས་རྒྱས་བཅོམ་ལྡན་འདས་གང་དག་བཞུགས་ཏེ་འཚོ་ཞིང་གཞེས་ལ་ཆོས་ཀྱང་སྟོན་པའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་གིས་ཁྱོད་ལ་རིན་པོ་ཆེ་སྣ་བདུན་གྱི་གདུགས་དག་བསྐུར་ཞིང་། གདུགས་དེ་དག་ཀྱང་སྟེང་གི་བར་སྣང་ལ་ཚངས་པའི་འཇིག་རྟེན་གྱི་མཐར་ཐུག་པའི་བར་དུ་གནས་པ་དག་མཐོང་བ་ནི།
en: Brahmin, in your dream you saw the bhagavat buddhas who reside, live, and remain, teaching the Dharma in realms in the ten directions as numerous as the grains of sand in the Ganges River, give you parasols made of the seven jewels, and those parasols reached as high into the sky as the Brahmā realm. “ ‘

source: བྲམ་ཟེ་གང་གི་ནུབ་མོ་ཁྱོད་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་བ་དེ་ཉིད་ཀྱི་ནུབ་མོ་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དག་ཏུ་ཁྱོད་ཀྱི་གྲགས་པ་དང་། སྒྲ་དང་། ཚིགས་སུ་བཅད་པ་རྒྱ་ཆེན་པོ་དག་མངོན་པར་འཕགས་པར་འགྱུར་ཞིང་། ཁྱོད་ཀྱི་སྤྱི་གཙུག་ཀྱང་ཚངས་པའི་འཇིག་རྟེན་གྱི་མཐར་ཐུག་པའི་བར་དུ་གྱེན་ཏུ་མངོན་པར་འཕགས་ཤིང་བལྟར་མི་ནུས་པར་གྱུར་ཏེ། བྲམ་ཟེ་རྨི་ལམ་དེ་ནི་དེའི་སྔ་ལྟས་ཡིན་ནོ།
en: Brahmin, that dream was an omen that on the night when you attain complete enlightenment and become a buddha, a verse praising your fame will be chanted in realms in the ten directions that are as numerous as the grains of sand in the Ganges River, and the crown of your head will rise as far as the realm of Brahmā so that no one will be able to see it. “ ‘

source: །བྲམ་ཟེ་གང་ཁྱོད་ཀྱིས་ཚངས་པའི་འཇིག་རྟེན་གྱི་བར་དུ་ཐུག་པའི་ལུས་ཆེན་པོ་དང་། ཉི་མའི་དཀྱིལ་འཁོར་གྱི་ཕྲེང་བ་དག་མགོ་ལ་བཅིངས་པར་མཐོང་བ་གང་ཡིན་པ་དེ་ནི་བྲམ་ཟེ་ཁྱོད་ཀྱིས་སེམས་ཅན་བགྲང་བ་ལས་ཡང་དག་པར་འདས་པ་དག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཡང་དག་པར་འཛིན་དུ་བཅུག་པ་གང་ཡིན་པ་དེ་དག་ཀྱང་ཁྱོད་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པ་ན།
en: Brahmin, you saw a garland of sun disks bound around your head.

source: ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་སངས་རྒྱས་ཀྱི་ཞིང་གི་རྡུལ་ཕྲ་རབ་ཀྱི་རྡུལ་སྙེད་དག་ཏུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་ཏེ།
en: That dream was an omen that the countless beings you have caused to aspire to the highest, most complete enlightenment will, brahmin, attain complete enlightenment and become buddhas in worlds in the ten directions as numerous as the particles in a buddha realm.

source: ཁྱོད་ཀྱིས་བྱང་ཆུབ་ཡང་དག་པར་འཛིན་དུ་བཅུག་པ་གང་ཡིན་པ་དེ་དག་ཐམས་ཅད་ཡང་དང་ཡང་དུ་ཁྱོད་ཀྱི་བསྔགས་པ་རྗོད་པར་གྱུར་ཏེ། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དེས་བདག་ཅག་དང་པོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཡང་དག་པར་འཛིན་དུ་བཅུག་པས་ན། དེས་ད་ལྟར་བདག་ཅག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ཏེ།
en: Those buddhas whom you caused to aspire to the highest, most complete enlightenment will praise you again and again, saying, “That tathāgata arhat samyaksam­buddha was the one who first caused us to aspire to the attainment of the highest, most complete enlightenment, which is why we have now attained the highest, most complete enlightenment and become buddhas.

source: དེ་ནི་བདག་ཅག་གི་དགེ་བའི་བཤེས་གཉེན་ཡིན་ནོ་ཞེས་བསྔགས་པ་བརྗོད་པར་འགྱུར་ཞིང་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་གིས་ཁྱོད་ལ་མཆོད་པ་བྱ་བའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔའ་དག་གཏོང་བར་འགྱུར་ཏེ།
en: He is our kalyāṇamitra.” They will praise you, and those bhagavat buddhas will send bodhisattvas to make offerings to you.

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་དག་གིས་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་འཕྲུལ་པ་སྣ་ཚོགས་དག་གིས་ཁྱོད་ལ་མཆོད་པ་བྱས་ཤིང་།
en: Those bodhisattva mahāsattvas will make offerings to you through the various miraculous powers of a bodhisattva.

source: དེར་ཁྱོད་ལས་ཆོས་ཐོས་ནས་ཏིང་ངེ་འཛིན་དང་།
en: They will then listen to the Dharma from you. They will attain various kinds of samādhi, dhāraṇī, and acceptance.

source: གཟུངས་དང་། བཟོད་པ་རྣམ་པ་སྣ་ཚོགས་དག་ཐོབ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་དག་རང་རང་གི་སངས་རྒྱས་ཀྱི་ཞིང་དག་ཏུ་དོང་སྟེ། ཁྱོད་ཀྱི་བསྔགས་བརྗོད་པར་འགྱུར་ཞིང་དབྱངས་རྗེས་སུ་སྒྲོགས་པར་འགྱུར་ཏེ།
en: Then those bodhisattva mahāsattvas will return to their own buddha realms, where they will constantly chant your praises. “ ‘

source: བྲམ་ཟེ་ཁྱོད་ཀྱི་རྨི་ལམ་དེ་ནི་དེའི་སྔ་ལྟས་ཡིན་ནོ། །བྲམ་ཟེ་གང་ཁྱོད་ཀྱི་རྨི་ལམ་ན་བྱང་ཆུབ་སེམས་དཔའ་བྱེ་བ་ཁྲག་ཁྲིག་འབུམ་ཕྲག་དྲུག་ཅུ་ཁོང་བར་ཞུགས་ནས་དེ་དག་པད་མ་དག་ལ་སྐྱིལ་མོ་ཀྲུང་བཅས་ཏེ་འདུག་ཅིང་བསམ་གཏན་སྒོམ་པ་དག་མཐོང་བ་ནི་བྲམ་ཟེ་ཁྱོད་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པ་ན།
en: Brahmin, in your dream you saw hundreds of thousands of millions of trillions of bodhisattvas inside your body, sitting cross-legged on lotuses and meditating in dhyāna.

source: གང་དག་སྲོག་ཆགས་བྱེ་བ་ཁྲག་ཁྲིག་འབུམ་དག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཡང་དག་པར་འཛིན་དུ་བཅུག་པར་འགྱུར་ཞིང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པ་དག་ལ་འགོད་པར་འགྱུར་བ་དེ་དག་ཀྱང་བྲམ་ཟེ་ཁྱོད་བླ་ན་མེད་པའི་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བས་ཡོངས་སུ་མྱ་ངན་ལས་འདས་ནས།
en: Brahmin, that dream was an omen that you will cause many hundreds of thousands of millions of trillions of beings to aspire to attain the highest, most complete enlightenment and will establish them in irreversible progress toward the highest, most complete enlightenment.

source: བསྐལ་པ་སངས་རྒྱས་ཀྱི་ཞིང་རྡུལ་ཕྲ་རབ་ཀྱི་རྡུལ་སྙེད་འདས་པའི་འོག་ཏུ་ཕྱོགས་བཅུའི་སངས་རྒྱས་ཀྱི་ཞིང་གཞན་དག་ཏུ་ཆོས་ཀྱི་རྒྱལ་སྲིད་མཛད་པའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་སུ་འགྱུར་བ་ན།
en: Brahmin, after you have passed into parinirvāṇa, when eons as numerous as the particles in a buddha realm have passed, they will become bhagavat buddhas with Dharma kingdoms in other buddha realms in the ten directions.

source: འདི་སྐད་དུ་བསྐལ་པ་གྲངས་མེད་པ་འདས་པ་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་མཚན་འདི་ཞེས་བྱ་བ་ཞིག་བྱུང་སྟེ།
en: They will say, “Countless eons ago, there was a tathāgata arhat samyaksam­buddha of such a name, and that tathāgata arhat samyaksam­buddha caused us to believe in, guided us to, led us to the highest, most complete enlightenment, and brought us to a state of irreversibility.

source: དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དེས་བདག་ཅག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཡང་དག་པར་འཛིན་དུ་བཅུག་སྟེ་བཏུལ་ཅིང་བཙུད་དེ་རབ་ཏུ་བཀོད་ནས་ཕྱིར་མི་ལྡོག་པ་ལ་བཀོད་པས་ན་དེས་ད་ལྟར་བདག་ཅག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ཤིང་ཆོས་ཀྱི་རྒྱལ་སྲིད་ཀྱང་བརྙེས་སོ་ཞེས་ཁྱོད་ཀྱི་བསྔགས་པ་རྗོད་པར་འགྱུར་ཏེ།
en: Because of that we have now attained the highest, most complete enlightenment of buddhahood.” “ ‘

source: བྲམ་ཟེ་ཁྱོད་ཀྱི་རྨི་ལམ་དེ་ནི་དེའི་སྔ་ལྟས་ཡིན་ནོ། །བྲམ་ཟེ་གང་ཁྱོད་ཀྱི་རྨི་ལམ་ན་ཕག་གི་གདོང་དང་། ཁྱིའི་གདོང་གི་བར་དུ་གྱུར་ཅིང་ལུས་ཁྲག་གིས་བསྐུས་ཏེ་སྲོག་ཆགས་རྣམ་པ་དུ་མ་དག་ཟོས་ནས་ཨེ་རན་དའི་ཤིང་ངན་པའི་དྲུང་ན་འདུག་པ་དང་།
en: Brahmin, in your dream you saw someone with a blood-soaked body and a boar’s face, and so on, up to and including someone with a dog’s face, devouring many different kinds of animals.

source: དེ་ཡང་སྲོག་ཆགས་རྣམ་པ་དུ་མ་གཞན་དག་གིས་ཟོས་ཤིང་ཀེང་རུས་ཀྱི་བར་ལ་ཐུག་པར་བྱས་ཏེ་བོར་བ་དང་།
en: Then they sat at the foot of a vile castor-oil tree and were eaten by many animals until there was nothing left but scattered bones.

source: ཡང་ལུས་ཕྱིར་སྐྱེས་ནས་ལུས་ཁྲག་གིས་བསྐུས་ཤིང་ཁྱིའི་གདོང་གི་བར་དུ་གྱུར་པས་སྲོག་ཆགས་རྣམ་པ་མང་པོ་དག་ཟོས་ནས་ཡང་ཨེ་རན་དའི་ཤིང་ངན་པའི་དྲུང་ན་འདུག་པ་དང་།
en: Then they again appeared with blood-soaked bodies, and so on, up to and including someone with a dog’s face, devouring many different kinds of animals. Then they sat at the foot of a vile castor-oil tree and were eaten by many animals. “ ‘

source: སྲོག་ཆགས་རྣམ་པ་དུ་མ་དག་གིས་ཟོས་པར་མཐོང་བ་ནི་ཁྱོད་ཀྱིས་སྐྱེས་བུ་བླུན་པོ་བསོད་ནམས་བྱ་བའི་དངོས་པོ་གསུམ་པོ་སྦྱིན་པ་དང་། དུལ་བ་དང་། ཡང་དག་པར་སྡོམ་པ་ཡང་དག་པར་འཛིན་དུ་བཅུག་ཅིང་རབ་ཏུ་བཀོད་པ་དེ་དག་ལྷ་རྣམས་ཀྱི་ནང་དུ་འཆི་འཕོ་བའི་སྡུག་བསྔལ་འདོད་པ་དང་།
en: Brahmin, this is an omen that the many deluded beings whom you have caused to adopt, and continue in, the three activities that create merit—generosity, self-control, and restraint—crave that which will result in the suffering of dying and leaving the paradises.

source: མི་རྣམས་ཀྱི་ནང་དུ་རྒ་བ་དང་། ན་བ་དང་། འཆི་བ་དང་། མི་སྡུག་པ་དང་ཕྲད་པ་དང་། སྡུག་པ་དང་བྲལ་བའི་སྡུག་བསྔལ་དང་།
en: They crave that which will result in the human suffering of aging, sickness, death, encountering what they do not want, and being separated from what they want.

source: ཡི་དགས་རྣམས་ཀྱི་ནང་དུ་བཀྲེས་པ་དང་། སྐོམ་པའི་སྡུག་བསྔལ་དང་།
en: They crave that which will result in the suffering of hunger and thirst among the pretas.

source: དུད་འགྲོ་རྣམས་ཀྱི་ནང་དུ་གཏི་མུག་གི་མུན་པ་དང་། མགོ་གཅོད་པ་ལ་སོགས་པའི་སྡུག་བསྔལ་དང་།
en: They crave that which will result in the suffering of dullness, stupidity, being beheaded, and so on among the animals.

source: སེམས་ཅན་དམྱལ་བ་རྣམས་ཀྱི་ནང་དུ་གནོད་པ་སྣ་ཚོགས་ལ་སོགས་པའི་སྡུག་བསྔལ་འདོད་པར་འགྱུར་བ་དང་བསོད་ནམས་བྱ་བའི་དངོས་པོ་རྣམ་པ་གསུམ་པོ་དག་ལ་རབ་ཏུ་བཀོད་པ་རྣམས་ལྷ་རྣམས་ཀྱི་ནང་དུ་ལྷའི་རྒྱལ་སྲིད་འདོད་ལ་མི་རྣམས་ཀྱི་ནང་དུ་ནི་གླིང་གཅིག་གི་དབང་ཕྱུག་འདོད་དེ།
en: They crave that which will result in the suffering of being burned, cut, killed, bound, and so on in the hells. “ ‘Those whom you have established in the three activities that create merit crave to be deva kings among devas, and rulers of a continent among humans.

source: དེ་དག་དེར་སེམས་ཅན་ཐམས་ཅད་ལ་ལོངས་སྤྱོད་པར་འགྱུར་ཞིང་། དེ་དག་ཀྱང་སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཁ་ཟས་དང་།
en: All beings will subsist on them; they will be the source of food and subsistence for all beings.

source: ལོངས་སྤྱོད་དུ་འགྱུར་བས་དེ་ལྟར་སྐྱེས་བུ་བླུན་པོ་དེ་དག་ཡུན་རིང་པོར་འཁོར་བར་སྡུག་བསྔལ་ཉམས་སུ་མྱོང་བར་འགྱུར་ཏེ།
en: Those deluded individuals will experience those sufferings for a long time in saṃsāra. “ ‘

source: བྲམ་ཟེ་ཁྱོད་ཀྱི་རྨི་ལམ་དེ་ནི་དེའི་སྔ་ལྟས་ཡིན་ནོ། །བྲམ་ཟེ་གང་ཁྱོད་ཀྱི་རྨི་ལམ་ན་མི་ཁ་ཅིག་སྣ་མའི་མེ་ཏོག་གི་ཕྲེང་བ་དག་གིས་མགོ་བརྒྱན་ཅིང་། མ་ཧེའི་ཤིང་རྟ་དག་ལ་ཞོན་ཏེ་ལམ་གོལ་བར་ཞུགས་ནས་གཡས་ཕྱོགས་སུ་ལྟ་ཞིང་དོང་བར་མཐོང་བ་དེ་ཡང་བྲམ་ཟེ་ཁྱོད་ཀྱིས་བསོད་ནམས་བྱ་བའི་དངོས་པོ་གསུམ་པོ་དག་ལ་རབ་ཏུ་བཀོད་པའི་རིགས་ཀྱི་བུ་དག་གཅིག་བདག་དུལ་བར་བྱ་བ་དང་།
en: Brahmin, you saw in a dream some people with their heads adorned with garlands of flowers riding in a buffalo-drawn carriage taking the wrong road facing south.

source: བདག་ཞི་བར་བྱ་བ་འབའ་ཞིག་གི་ཕྱིར་ཉན་ཐོས་ཀྱི་ཐེག་པ་ལ་ཡང་དག་པར་ཞུགས་པར་འགྱུར་ཏེ། བྲམ་ཟེ་དེ་ནི་ཉན་ཐོས་ཀྱི་ཐེག་པ་པའི་གང་ཟག་དེ་དག་གི་སྔ་ལྟས་ཡིན་ནོ།
en: Brahmin, that was an omen that those beings are individuals who are followers of the Śrāvakayāna.’ “

source: །རིགས་ཀྱི་བུ་དེ་ནས་བྲམ་ཟེ་རྒྱ་མཚོའི་རྡུལ་གྱིས་རྒྱལ་པོ་རྩིབས་ཀྱི་མུ་ཁྱུད་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །རྒྱལ་པོ་ཆེན་པོའི་མིར་སྐྱེ་བ་ནི་རྙེད་པར་དཀའ། དལ་བ་ཕུན་སུམ་ཚོགས་པ་ཡང་རྙེད་པར་དཀའ། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་འཇིག་རྟེན་དུ་འབྱུང་བར་ཡང་ཨུ་དུམ་བཱ་རའི་མེ་ཏོག་ལྟར་རྙེད་པར་དཀའ།
en: Noble son, the brahmin Samudrareṇu then said these words to King Araṇemin: ‘Great king, it is difficult to gain a human birth, it is difficult to obtain the perfect opportunity, and the appearance of the tathāgata arhat samyaksam­buddhas in this world is as rare as a fig-tree flower.

source: དགེ་བའི་ཆོས་ལ་འདུན་པ་ཡང་རྙེད་པར་དཀའ། ཡང་དག་པའི་སྨོན་ལམ་ཡང་རྙེད་པར་དཀའ་ལགས་སོ།
en: It is difficult to acquire the aspiration for the virtuous Dharma. It is difficult to have the right prayers.

source: །རྒྱལ་པོ་ཆེན་པོ་ལྷའི་རྒྱལ་སྲིད་ནི་སྡུག་བསྔལ་འབྱུང་བའི་རྒྱུ་ལགས་སོ་གླིང་གཅིག་གི་མི་རྣམས་ཀྱི་རྒྱལ་སྲིད་ཀྱང་སྡུག་བསྔལ་འབྱུང་བའི་རྒྱུ་ལགས་སོ།
en: Great king, having a deva kingdom is a cause of suffering. Having a human kingdom that is an entire continent is also a cause of suffering.

source: །གླིང་གཉིས་དང་། གསུམ་དང་། གླིང་བཞི་པའི་རྒྱལ་སྲིད་ཀྱང་སྡུག་བསྔལ་འབྱུང་བའི་རྒྱུ་ལགས་ཏེ།
en: Having a kingdom that is two continents, three continents, or four continents is also a cause of suffering.

source: རྒྱལ་པོ་ཆེན་པོ་ཡུན་རིང་པོར་འཁོར་བའི་སྡུག་བསྔལ་ཉམས་སུ་མྱོང་བར་བགྱིད་པ་ལགས་སོ།
en: Great king, they cause experiences of suffering for a long time in saṃsāra.

source: །རྒྱལ་པོ་ཆེན་པོ་ལྷ་དང་མིའི་འབྱོར་པ་ནི་རླུང་གི་ཤུགས་བཞིན་དུ་གཡོ་ཞིང་མི་གནས་པ་ལགས་སོ།
en: Great king, divine wealth and human wealth are unstable and unreliable like the force of the wind.

source: །བྱིས་པ་རྣམས་ནི་ཆུ་ཟླ་ལྟ་བུའི་འདོད་པའི་ཡོན་ཏན་ལྔས་ངོམས་མི་མྱོང་ཞིང་ཡུལ་རྣམས་ལ་མྱོས་ནས་ལྷ་དང་མིའི་དཔལ་འཚལ་བར་བགྱིད་དེ།
en: Fools, though they can never attain satisfaction from sensory pleasures, which are like the reflection of the moon on water, are intoxicated by pleasure and crave the splendor of devas and humans.

source: བྱིས་པ་དེ་དག་ནི་ཡང་དང་ཡང་དུ་སེམས་ཅན་དམྱལ་བ་རྣམས་སུ་གནོད་པའི་སྡུག་བསྔལ་དང་། དུད་འགྲོ་རྣམས་ཀྱི་ནང་དུ་ཀུན་ཏུ་གཏི་མུག་པའི་སྡུག་བསྔལ་དང་། ཡི་དགས་རྣམས་ཀྱི་ནང་དུ་བཀྲེས་པ་དང་སྐོམ་པའི་སྡུག་བསྔལ་དང་། མི་རྣམས་ཀྱི་ནང་དུ་སྡུག་པ་དང་བྲལ་བའི་སྡུག་བསྔལ་དང་། ལྷ་རྣམས་ཀྱི་ནང་དུ་འཆི་འཕོའི་སྡུག་བསྔལ་དང་།
en: Again and again, these fools experience the suffering of the hells, an animal’s suffering of stupidity, a preta’s suffering of hunger and thirst, a human’s suffering of being separated from loved ones, the suffering of dying and passing away among the devas, the suffering of being within a womb, the suffering of beheading each other, and the suffering of devouring each other.

source: ཡང་མངལ་དུ་གནས་པའི་སྡུག་བསྔལ་དང་། གཅིག་གིས་གཅིག་མགོ་གཅོད་པའི་སྡུག་བསྔལ་དང་། གཅིག་ལ་གཅིག་འཚལ་བའི་སྡུག་བསྔལ་ཉམས་སུ་མྱོང་བར་འགྱུར་ཏེ། བྱིས་པ་རྣམས་འཁྱམ་པ་ན་དེ་ལྟ་བུའི་སྡུག་བསྔལ་དག་ཉམས་སུ་མྱོང་བར་འགྱུར་རོ།
en: These wandering fools have to experience those kinds of suffering.

source: །དེ་ཅིའི་སླད་དུ་ཞེ་ན།
en: Why?

source: དགེ་བའི་བཤེས་གཉེན་དང་བྲལ་བས་མ་ཐོབ་པ་ཐོབ་པར་བགྱི་བ་དང་། མ་རྟོགས་པ་རྟོགས་པར་བགྱི་བ་དང་། མངོན་སུམ་དུ་མ་བགྱིས་པ་མངོན་སུམ་དུ་བགྱི་བའི་སླད་དུ་ཡང་དག་པའི་སྨོན་ལམ་མི་འདེབས་ཤིང་རྩོལ་བར་མི་བགྱིད་པའི་སླད་དུ་སྟེ།
en: It is because they have no kalyāṇamitra, they do not make the right prayers, and they do not make the effort to attain that which has not been attained, realize that which has not been realized, and manifest that which has not been made manifest.

source: དེ་ལྟར་བྱིས་པ་གླེན་པ་དག་ནི་གང་ལ་སྡུག་བསྔལ་ཐམས་ཅད་བས་པར་འགྱུར་བའི་བྱང་ཆུབ་ཀྱི་སེམས་ཀྱིས་སྐྱོ་བར་བགྱིད་ཅིང་གང་ལ་ཡང་དང་ཡང་དུ་སྡུག་བསྔལ་འབྱུང་བར་འགྱུར་བའི་འཁོར་བས་སྐྱོ་བར་མི་བགྱིད་ཅིང་ཡིད་འབྱུང་བར་མི་བགྱིད་དོ།
en: These stupid fools tire of the aspiration for enlightenment—which ends suffering—but do not tire of saṃsāra—which brings suffering again and again—and they have no wish to leave it. “ ‘

source: །རྒྱལ་པོ་ཆེན་པོ་དེ་ལྟ་བས་ན་འཁོར་བ་ནི་སྡུག་བསྔལ་ཐམས་ཅད་ཀྱི་སྣོད་དུ་གྱུར་པ་ལགས་པར་ཡོངས་སུ་བརྟག་པ་མཛད་ཅིང་རྒྱལ་པོ་ཆེན་པོ་འདི་ལྟར་ཁྱོད་ཀྱིས་ནི་བཅོམ་ལྡན་འདས་ཀྱི་བསྟན་པ་ལ་ལྷག་པར་མཛད་པ་མཛད་དེ་དགེ་བའི་རྩ་བ་ནི་བསྐྲུན།
en: Great king, consider how saṃsāra is the container of all sufferings.

source: དཀོན་མཆོག་གསུམ་ལ་དད་པ་ནི་བརྙེས། ལོངས་སྤྱོད་ཆེན་པོའི་ཕྱིར་བཅོམ་ལྡན་འདས་ལ་དབུལ་བ་ནི་ཕུལ། མཐོ་རིས་སུ་སྐྱེ་བ་ཐོབ་པར་བགྱི་བའི་སླད་དུ་ཚུལ་ཁྲིམས་ནི་བསྲུངས།
en: Great king, you have honored the teachings of the Bhagavat, planted good roots, gained faith in the Three Jewels, made offerings to the Bhagavat in order to have great wealth, and maintained correct conduct in order to have rebirth in the higher realms.

source: བཅོམ་ལྡན་འདས་ལ་ཆོས་གསན་པས་ཁྱོད་ཤེས་རབ་ཆེན་པོ་བརྙེས་པར་ནི་གྱུར། མཆོད་སྦྱིན་ནི་མཛད་ལགས་ཀྱིས།
en: You have gained great wisdom through listening to the Dharma from the Bhagavat.

source: རྒྱལ་པོ་ཆེན་པོ་ཁྱོད་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཐུགས་སྐྱེད་ཅིག །
en: Now, you should make offerings so as to develop the aspiration for the highest, most complete enlightenment.’ “

source: སྨྲས་པ།
en: The king replied, ‘Enough, brahmin.
